Repository: mix5003/Raptor-Mix-Edition
Catalog: Translations/Strings.*.resx
Languages: pt_br

source: About NClass
pt_br: Sobre NClass

source: Access
pt_br: Acesso

source: Access:
pt_br: Acesso:

# add_new_aggregation
source: New Aggregation
pt_br: Nova Agregação

# add_new_association
source: New Association
pt_br: Nova Associação

source: Add New Class
pt_br: Adicione Nova Classe

source: Add New Comment
pt_br: Adicione Novo Comentário

# add_new_comment_relation
source: New Comment Relation
pt_br: Novo Comentário da Relação

# add_new_composition
source: New Composition
pt_br: Nova Composição

source: Add New Delegate
pt_br: Adicione Novo Delegate

source: Add New Enum
pt_br: Adicione Novo Enumerador

# add_new_generalization
source: Inherits From
pt_br: Nova Generalização

source: Add New Interface
pt_br: Adicione Nova Interface

source: Add new item:
pt_br: Adicione Novo Item

# add_new_nesting
source: Nested inside
pt_br: New Nesting

# add_new_realization
source: Implements
pt_br: Nova Realização

# add_new_struct
source: Add New Structure
pt_br: Adicione Nova Struct

source: Aggregation
pt_br: Agregação

source: Association
pt_br: Associação

# button_add_item
source: Add item
pt_br: Novo item

# button_apply
source: Apply
pt_br: Aplicar

# button_cancel
source: Cancel
pt_br: Cancelar

# button_close
source: Close
pt_br: Fechar

# button_load
source: Load
pt_br: Carregar

# button_modify
source: Modify
pt_br: Modificar

# button_save
source: Save
pt_br: Salvar

source: Checking for Updates
pt_br: Procurando Atualizações

# clear_recent_list
source: Clear recent files list
pt_br: Limpando lista de arquivos recentes

source: Command failed.
pt_br: Comando falhou.

source: Comment
pt_br: Comentário

source: Composition
pt_br: Composição

source: Confirmation
pt_br: Confirmação

source: Delete
pt_br: Remover

# delete_confirmation
source: Are you sure you want to delete the selected item(s)?
pt_br: Você tem certeza que quer remover o(s) ítem(s) selecionados?

source: Delete selected item(s)
pt_br: Delete os ítens selecionados

source: Dependency
pt_br: Dependencia

source: Diagram
pt_br: Diagrama

# diagram_language
source: {0} diagram
pt_br: {0} diagrama

source: Diagram style
pt_br: Estilo do Diagrama

source: diagrams
pt_br: diagramas

source: « Double click to edit »
pt_br: « Duplo click para editar »

source: Edit Comment
pt_br: Edite o Comentário

source: Error
pt_br: Erro

# error_accessor_modifier
source: Invalid accessor modifier.
pt_br: Modificador de acesso inválido.

# error_cannot_add_same_base_interface
source: Cannot add the same base interface.
pt_br: Não pode adicionar a mesma interface base.

# error_cannot_add_same_interface
source: Cannot add the same interface.
pt_br: Não pode adicionar a mesma interface.

# error_cannot_crate_delegate
source: Cannot create delegates in {0}.
pt_br: Não pode criar delegates no {0}.

# error_cannot_create_relation
source: Cannot create relation between the two objects.
pt_br: Não pode criar a relação entre os objetos.

# error_cannot_create_struct
source: Cannot create structures in {0}.
pt_br: Não pode criar estruturas no {0}.

# error_cannot_inherit
source: Cannot inherit from static or sealed class.
pt_br: Não pode herdar classes estáticas ou seladas.

# error_cannot_override
source: Cannot override non-virtual method.
pt_br: Não pode sobre escrever um método não virtual.

# error_cannot_save_file
source: Cannot save file with unspecified path.
pt_br: Não pode salvar um arquivo sem um caminho específico.

# error_cannot_set_access
source: Cannot set accessibility.
pt_br: Não pode colocar acessibilidade.

# error_cannot_set_modifier
source: Cannot set the modifier.
pt_br: Não pode colocar modificador.

# error_cannot_set_static
source: Cannot set static modifier.
pt_br: Não pode colocar um modificador estático.

# error_cannot_set_type
source: Cannot set type.
pt_br: Não pode colocar um tipo

# error_connect_to_server
source: Could not connect to the server.
pt_br: Não é possível conectar ao servidor.

# error_const_lack_of_initialization
source: Constant variables must be initialized.
pt_br: Variáveis constantes precisam ser inicializadas.

# error_constructor_name
source: Constructor's name does not equal with the class name.
pt_br: Nome do construtos não é igual ao nome da classe.

# error_corrupt_save_format
source: Corrupt save format.
pt_br: Formato de salvamento corrompido.

# error_corrupt_savefile
source: The save file is corrupt and could not load.
pt_br: O arquivos esta corrompido e não pode ser aberto.

# error_could_not_load_file
source: Could not load file.
pt_br: Arquivo não pode ser carregado.

# error_could_not_save_file
source: Could not save file.
pt_br: Arquivos não pode ser salvo.

# error_cyclic_base
source: The base {0} is successor of the child {0}.
pt_br: A base {0} é sucessor do filho {0}.

# error_cyclic_nesting
source: Cyclic nesting relationships.
pt_br: Relações próximas ciclicas.

# error_empty_filename
source: The file name cannot be empty.
pt_br: O nome do arquivo não pode estar vazio.

# error_empty_string
source: The {0} cannot be empty string.
pt_br: O {0} não pode ser uma string vazia.

# error_explicit_implementation
source: Cannot implement explicit.
pt_br: Não pode ser implementado explícitamente.

# error_file_not_found
source: File not found or no read permission.
pt_br: Arquivo não encontrado ou sem permissão de acesso.

# error_forbidden_name
source: Forbidden name.
pt_br: Nome recusado.

# error_forbidden_type_name
source: Forbidden type name.
pt_br: Tipo de nome recusado.

source: Error in saving image.
pt_br: Erro ao salvar imagem

source: Error in saving settings.
pt_br: Erro ao salvar as configurações.

# error_interface_language
source: The interface class is not {0} interface.
pt_br: A classe interface não é {0} interface.

# error_interface_member_access
source: Cannot set accessibility of interface members.
pt_br: Não é possível colocar acessibilidade do membros de interface.

# error_invalid_declaration
source: Invalid declaration.
pt_br: Declaração invalida.

# error_invalid_name
source: Invalid name.
pt_br: Nome Inválido.

# error_invalid_parameter_declaration
source: Invalid parameter declaration.
pt_br: Declaração de parametro inválido.

# error_invalid_type_name
source: Invalid type name.
pt_br: Tipo de nome inválido

# error_languages_do_not_equal
source: Languages do not equal.
pt_br: Linguagens não são iguais.

# error_member_type_does_not_exist
source: {0} type of member does not exist.
pt_br: {0} tipo de membro não existe.

# error_operator_must_be_public
source: Operator method must be public.
pt_br: Método operador deve ser público

# error_operator_must_be_static
source: Operator method must be static.
pt_br: Método operador deve ser estático.

# error_parameter_type
source: Parameter's type cannot ber {0}.
pt_br: Tipo de parametros devem ser {0}.

# error_read_version_data
source: Could not read version data.
pt_br: Não é possível ver a data da versão.

# error_relation_does_not_exist
source: The specified relation does not exist.
pt_br: A relação expecificada não existe

# error_reserved_name
source: This is a reserved name.
pt_br: Este é um nome reservado.

# error_static_constructor
source: Static constructors must be parameterless.
pt_br: Construtores estáticos não devem ter parametros.

# error_static_indexer
source: Indexer cannot be static.
pt_br: Indexadores não podem ser estáticos.

# error_static_interface_member
source: Interface members cannot be static.
pt_br: Membros interface não podem ser estáticos.

# error_type
source: Type cannot be {0}.
pt_br: Tipo não pode ser {0}.

# error_type_does_not_exist
source: {0} type does not exist.
pt_br: {0} tipo não existe.

# errors_reason
source: Reason
pt_br: Razão

source: General
pt_br: Geral

source: Generalization
pt_br: Generalização

source: Implement explicitly
pt_br: Implementação explícita

source: Implementing
pt_br: Implementando

source: Initial value
pt_br: Valor inicial

source: Item
pt_br: Ítem

# items_of_type
source: Items of {0}
pt_br: Items do {0}

# items_selected
source: {0} selected items.
pt_br: {0} ítens selecionados

source: Language
pt_br: Linguagem

source: Load
pt_br: Carrega

source: Load last project
pt_br: Carregar o último projeto.

# members_of_type
source: Members of {0}
pt_br: Membros do {0}

# menu_about
source: &About NClass...
pt_br: &Sobre NClass...

# menu_add_new
source: &Add New
pt_br: &Adiciona Novo

# menu_aggregation
source: A&ggregation
pt_br: A&gregação

# menu_association
source: &Association
pt_br: &Associação

# menu_bidirectional
source: &Bidrectional
pt_br: &Bidirecional

# menu_check_for_updates
source: Check for &Updates
pt_br: Procurando por &Updates

# menu_comment
source: Comme&nt
pt_br: Come&ntario

# menu_comment_relation
source: Co&mment Relation
pt_br: Co&mentario da Relação

# menu_composition
source: C&omposition
pt_br: C&omposição

# menu_contents
source: &Contents
pt_br: &Conteúdo

# menu_copy_image_to_clipboard
source: &Copy to Clipboard as Image
pt_br: &Copiar Image para Área de Transferência

# menu_csharp_diagram
source: &C# diagram
pt_br: &C# diagrama

# menu_cut
source: Cu&t
pt_br: Cor&tar

# menu_dependency
source: &Dependency
pt_br: &Dependencia

# menu_diagram
source: &Diagram
pt_br: &Diagrama

# menu_direction
source: &Direction
pt_br: &Direção

# menu_edit
source: &Edit
pt_br: &Editar

# menu_edit_comment
source: &Edit comment...
pt_br: &Editar comentário...

# menu_edit_members
source: &Edit members...
pt_br: &Editar membros...

# menu_generalization
source: Genera&lizaion
pt_br: Genera&lização

# menu_initial_value
source: &Initial Value
pt_br: Valor &Inicial

# menu_java_diagram
source: &Java diagram
pt_br: &Java diagrama

# menu_members_format
source: &Member's Format
pt_br: Formatar &Membros

# menu_new
source: &New
pt_br: &Novo

# menu_new_file
source: &New File...
pt_br: &Novo Arquivo

# menu_open
source: &Open
pt_br: &Abrir

# menu_options
source: &Options...
pt_br: &Opções

# menu_parameter_names
source: Parameter &Names
pt_br: &Nomes dos Parametros

# menu_parameters
source: &Parameters
pt_br: &Parametros

# menu_paste
source: &Paste
pt_br: &Colar

# menu_print
source: &Print...
pt_br: &Imprimir

# menu_realization
source: &Realization
pt_br: &Realização

# menu_redo
source: &Redo
pt_br: &Refazer

# menu_save
source: &Save
pt_br: &Salvar

# menu_save_as
source: Save &As...
pt_br: Salvar &Como...

# menu_save_as_image
source: &Save As Image...
pt_br: &Salvar como Image...

# menu_select_all
source: &Select All
pt_br: &Selecionar Todos

# menu_struct
source: &Structure
pt_br: &Struct

source: Modifier:
pt_br: Modificador:

source: Modify item:
pt_br: Modificar item:

source: Move Down
pt_br: Mover para baixo

source: Move Up
pt_br: Mover para cima

source: Name
pt_br: Nome

source: Name:
pt_br: Nome:

source: New Constructor
pt_br: Novo Construtor

source: New Destructor
pt_br: Novo Destrutor

source: New Event
pt_br: Novo Evento

source: New Field
pt_br: Novo Campo

source: New Method
pt_br: Novo Método

source: New Property
pt_br: Nova Propriedade

# new_version
source: New version released
pt_br: Nova versão disponível

# no_updates
source: No updates are avaiable.
pt_br: Nenhum atualização disponível

# not_implemented
source: This function is not yet implemented.
pt_br: Esta funcionalidade não esta implementada ainda.

source: Options
pt_br: Opções

source: Override Members
pt_br: Sobreescrevendo Membros

source: Print
pt_br: Imprimir

# program_download
source: Do you want to download the update now?
pt_br: Você gostaria de realizar o download agora?

source: Readonly
pt_br: Somente Leitura

source: Ready
pt_br: Leitura

source: Realization
pt_br: Realização

source: Save
pt_br: Salvar

source: Save As
pt_br: Salvar Como

source: Save As Image
pt_br: Salvar como Imagem

# save_changes_confirmation
source: The file has been changed. Would you like to save the chages?
pt_br: O arquivo foi alterado. Você gostaria de salvar as mudancas?

# send_email
source: Send e-mail to the program's author
pt_br: Envie um email para o autor do programa.

# show_full_path
source: Show full file path in the header
pt_br: Mostre todo o caminho no cabeçalho

source: Sort by Access
pt_br: Organizar pelo acesso

source: Sort by Kind
pt_br: Organizar pela chave

source: Sort by Name
pt_br: Organizar pelo nome

source: Style
pt_br: Estilo

source: Style:
pt_br: Estilo:

source: Syntax
pt_br: Sintaxe

# translation_name
source: English
pt_br: BrazilianPortuguese

# translation_updated
source: English translation has been updated.
pt_br: Brazilian Portuguese translation has been updated.

source: Type
pt_br: Tipo

source: Type text:
pt_br: Tipo Texto:

source: Unknown
pt_br: Desconhecido

source: Untitled
pt_br: Sem Titulo

source: Use precision snapping
pt_br: Use mudança precisa

# version
source: {0} version
pt_br: {0} versão

source: Visible members:
pt_br: Membros Visiveis:

# visit_homepage
source: Visit program's homepage
pt_br: Visit a home page
